In [1]:
import pandas as pd

# Database Challenge 2

An analyst has asked you to run a query to see the number of movie tickets per genre that was sold in December last year. The data he needs is spread across two tables.

In [3]:
columns = ['TicketID', '#Seat Number', '#MovieId']
df = pd.DataFrame(columns = columns)

In [14]:
ticket_id = [10, 20, 30]
seat_number = ["1A", "2B", "4C"]
movie_id = [1, 2, 3]
df['TicketId'] = ticket_id 
df['#Seat Number'] = seat_number 
df['#MovieId'] = movie_id 
pd.set_option('colheader_justify', 'center')

In [8]:
columns = ['MovieId', '#Name', '#Genre'] 
df = pd.DataFrame(columns = columns)

In [9]:
movie_id = [1, 2, 3]
name = ['Citizen Kane', 'Shutter Island', 'Scarecrow'] 
genre = ['Drama', 'Mystery', 'Comedy']
df['MovieId'] = movie_id 
df['#Name'] = name 
df['#Genre'] = genre 
pd.set_option('colheader_justify', 'center')

In [5]:
df

   TicketId #Seat Number  #MovieId
0        10           1A         1
1        20           2B         2
2        30           4C         3

In [13]:
df

   MovieId           #Name   #Genre
0        1    Citizen Kane    Drama
1        2  Shutter Island  Mystery
2        3       Scarecrow   Comedy